[
  {
    "id": "hero",
    "text": "Machine learning engineer, full-stack software developer, and student researcher."
  },
  {
    "id": "whoami",
    "text": [
      "I am a 4th-year student studying Computer Science at the University of Michigan College of Engineering who is interested in exploring bleeding-edge web technologies and machine learning algorithms. I have experience in web systems, databases, machine learning, and native app development.",
      "I am currently conducting research under the Radiological Health Engineering Lab, where I am building cloud-native data pipelines and implementing machine learning models to learn from live radiation data.",
      "I am also working on optical character recognition correction with state-of-the art models such as T5 and BERT to improve text data for Proquest." 
    ]
  },
  {
    "id": "skills",
    "data": {
      "languages": [
        {
          "title": "Programming/Query",
          "content": "C/C++, Java, C#/.NET, Python, JavaScript, TypeScript, Rust, Julia, MatLab, Swift, SQL"
        },
        {
          "title": "Markup",
          "content": "HTML, XML, YAML, CSS, LaTeX, Markdown, Mermaid"
        }
      ],
      "frameworks": [
        {
          "title": "Web",
          "content": "React, Bootstrap, Flask, JAX-RS, ExpressJS, Rocket, Genie"
        },
        { 
          "title": "Machine Learning",
          "content": "PyTorch, Tensorflow 2.0, Huggingface, OpenCV, SKLearn, Jupyter Notebook"
        },
        {
          "title": "Databases",
          "content": "SQLite, MySQL, MongoDB, DynamoDB"
        }
      ],
      "infrastructures": [
        {
          "title": "Cloud",
          "content": "Amazon Web Services, Google Cloud, Heroku"
        },
        {
          "title": "Deployment",
          "content": "Jenkins, Ansible, IBM Websphere Liberty, DynDNS, Apache 2"
        },
        {
          "title": "Virtualization",
          "content": "KVM/QEMU, VirtualBox, VMWare, Docker" 
        }
      ],
      "certifications": [
        {
          "title": "AWS Solutions Architect - Associate",
          "image": "/aws-certified-solutions-architect-associate.png",
          "link": "https://www.credly.com/badges/7efc96eb-a493-431b-b3e7-2051f5e21039/embedded"
        }
      ]
    },
    "resume": "https://calvang.github.io/gh-docs/resume/Resume-current.pdf"
  },
  {
    "id": "portfolio"
  }
  ,
  {
    "id": "contact"
  }
]
