{
  "projects": [
    {
      "name": "Covid-19 Projection Heatmap",
      "image": "covid19-heatmap.jpg",
      "url": "https://covid19-projection-map.herokuapp.com/",
      "links": {
        "github": "https://github.com/calvang/covid19-heatmap"
      },
      "text": "The goal of this project is to provide an overview of the spread of Covid-19 and and a comprehensive API for viewing live US county data. The back-end is written in Rust using the Rocket framework for running asynchronous update processes. The heatmap interface utilizes the Google Maps Platform and is built using server-side rendered React code."
    },
    {
      "name": "Better-Zoom",
      "image": "better-zoom.png",
      "url": "https://shrouded-crag-20600.herokuapp.com",
      "links": {
        "github": "https://github.com/calvang/better-zoom"
      },
      "text": "A lightweight video chatting and messaging platform that uses public rooms that are completely customizable. Unlike other similar offerings, this web app does not store any client data and is completely unmoderated, with the philosophy of allowing easy room creation and communication between groups of friends."
    },
    {
      "name": "Integrated Website Terminal",
      "image": "site_terminal.png",
      "url": "https://calvang.github.io/#/Terminal-Demo",
      "links": {
        "github": "https://github.com/calvang/calvang-github-pages-home/tree/master/src/components/DraggableTerminal"
      },
      "text": "A terminal interface for navigating this website. It is completed serverless on the front-end and handles Linux-like inputs, functioning mainly as a cool way to view and explore my website. To open the terminal, click on the bottom-right corner of the page where there is a hidden gear icon. Clicking on this icon will open and close the integrated terminal."
    },
    {
      "name": "Markdown Blog",
      "image": "markdown_blog.png",
      "url": "https://calvang.github.io/#/Blog",
      "links": {
        "github": "https://github.com/calvang/calvang-github-pages-home/tree/master/src/views/Blog"
      },
      "text": "A personal blog that is automatically generated from Markdown files. Posts also feature social support through Facebook likes and comments. This is where I post tutorials and discuss technologies that excite me."
    },
    {
      "name": "Resumator",
      "image": "resumator.png",
      "url": "https://github.com/calvang/resumator",
      "links": {
        "github": "https://github.com/calvang/resumator"
      },
      "text": "An automated resume that applies Markdown input to jinja2 LaTeX templates. This application simplifies the formatting process by taking advantage of minimalistic Markdown syntax and makes dynamic changes that are carried over to a finalized LaTeX-generated pdf."
    }
  ]
}