{
  "projects": [
    {
      "name": "Covid-19 Projection Heatmap",
      "image": "covid19-heatmap.jpg",
      "url": "https://calvang.github.io/covid19-heatmap-demo/index.html",
      "links": {
        "github": "https://github.com/calvang/covid19-heatmap"
      },
      "text": "The goal of this project is to provide an overview of the spread of Covid-19 and a projection of its predicted case counts in the form of a interpolated heat map.  Current projections hint at a grim future in this pandemic, and it is vital that we all stay vigilant even if the cases seem to dwindle. Hopefully this visual representation can convey the importance of keeping up prevention measures to slow the spread."
    },
    {
      "name": "Integrated Website Terminal",
      "image": "site_terminal.png",
      "url": "https://calvang.github.io/#/Terminal-Demo",
      "links": {
        "github": "https://github.com/calvang/calvang-github-pages-home/tree/master/src/components/DraggableTerminal"
      },
      "text": "A terminal interface for navigating this website. It is completed serverless on the front-end and handles Linux-like inputs, functioning mainly as a cool way to view and explore my website. To open the terminal, click on the bottom-right corner of the page where there is a hidden gear icon. Clicking on this icon will open and close the integrated terminal."
    },
    {
      "name": "Markdown Blog",
      "image": "markdown_blog.png",
      "url": "https://calvang.github.io/#/Blog",
      "links": {
        "github": "https://github.com/calvang/calvang-github-pages-home/tree/master/src/views/Blog"
      },
      "text": "A personal blog that is automatically generated from Markdown files. Posts also feature social support through Facebook likes and comments. This is where I post tutorials and discuss technologies that excite me."
    },
    {
      "name": "Resumator",
      "image": "resumator.png",
      "links": {
        "github": "https://github.com/calvang/resumator"
      },
      "text": "An automated resume that applies Markdown input to jinja2 LaTeX templates. This application simplifies the formatting process by taking advantage of minimalistic Markdown syntax and makes dynamic changes that are carried over to a finalized LaTeX-generated pdf."
    },
    {
      "name": "Tubify",
      "links": {
        "github": "https://github.com/calvang/Tubify"
      },
      "text": "A simple Python application that ports a Youtube playlist to Spotify. Utilizes the Youtube and Spotify API's to access information from registered users. Future work will include porting this into Javascript and React Native to deploy a Chromium extension or Mobile Widgets"
    },
    {
      "name": "Wikipedia Table Scraper",
      "links": {
        "github": "https://github.com/calvang/wikipedia-table-web-scraper"
      },
      "text": "A web scraper application using Beautiful Soup for collect data into CSV or JSON files. Designed to scrape location data for the Covid-19 Heatmap project. Can be adapted to scrape various table formats from different static sites."
    }
  ]
}